using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

//Задачи:
//1.Опишите класс Student, который:
//1.1 Содержит имя.
//1.2 Предоставляет имя, через свойство.
//1.3 Содержит возраст.
//1.4 Предоставляет возраст через метод.
//1.5 Содержит конструктор, принимающий имя студента и возраст.
//1.6 Содержит поле, показывающее, является ли студент совершеннолетним.
//1.7 При инициализации поля имени в конструкторе вычисляет, является ли студент совершеннолетним в приватном методе.

//2. Опишите класс Dog
//2.1 Содержит имя.
//2.2 Содержит состояние: enum { sit, lie, stand }
//2.3 Содержит метод, выполняющий команду "{Имя}, cидеть". Меняет состояние собаки на соответствующее.
//2.4 Содержит метод, выполняющий команду "{Имя}, лежать". Меняет состояние собаки на соответствующее.

namespace lesson_oop
{
    internal class Class2
    {
    }
}
