using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;


//Описать абстрактный класс Animal
//1.1 Добавить поле name
//1.2 Добавить неабстрактный метод GetName()
//1.3 Добавить абстрактный метод MakeSound()
//2. Описать интерфейсы 
//2.1 Описать интерфейс IFlying
//2.1.1 Добавить метод Fly(лететь)
//2.2	Описать интерфейс IWalking
//2.2.1 Добавить метод Walk(ходить)
//2.3 Описать интерфейс ISwiming
//2.3.1 Добавить метод Swim(плавать)
//3. Описать классы с наследованием от необходимых интерфейсов:
//3.1 Cat
//3.2 Eagle
//3.3 Fish
//3.4 Duck
//3.4.1 Создать объект Duck
//3.4.2 Инициализировать новую переменную Animal с присвоением ей объекта из п.3.4.1
//3.4.3 Инициализировать новую переменную IFlying с присвоением ей объекта из п.3.4.1
//3.4.4 Посмотреть, какие члены класса доступны для каждой из переменных

namespace lesson_oop
{
    internal class Class1
    {
    }
}
